# taps
tap "homebrew/binary"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/cask-drivers"
tap "caskroom/cask"
tap "sambadevi/powerlevel9k"
tap "shopify/shopify"
tap "gemfury/tap"
tap "robscott/tap"

# binaries
brew "stow"
brew "grep"
brew "awscli"
brew "bash"
brew "jq"
brew "python"
brew "bash-completion@2"
brew "kubernetes-cli"
brew "python3"
brew "bazaar"
brew "kubernetes-helm"
brew "python@2"
brew "cfssl"
brew "rbenv"
brew "coreutils"
brew "curl"
brew "ruby"
brew "docker"
brew "docker-compose"      
brew "screen"
brew "docker-machine"      
brew "socat"
brew "findutils"
brew "moreutils"
brew "gcc"
brew "ssh-copy-id"
brew "node"
brew "terraform"
brew "git"
brew "openssh"
brew "tmux"
brew "git-crypt"
brew "openssl"
brew "tree"
brew "glide"
brew "watch"
brew "wget"
brew "go"
brew "mas"
brew "gnu-sed"
brew "kubectx"
brew "hub"
brew "wireguard-tools"
brew "yq"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "asdf"
brew "powerlevel9k"
brew "vault"
brew "pipenv"
brew "lastpass-cli"
brew "nvim"
brew "ansible"
brew "pre-commit"
brew "mfuentesg/tap/ksd"
brew "stern"
brew "FairwindsOps/tap/rbac-lookup"
brew "minamijoyo/tfupdate/tfupdate"
brew "ack"
brew "terraform-docs"
brew "skaffold"
brew "ejson"
brew "gemfury"
brew "zaquestion/tap/lab"
#brew "helmfile" install with asdf
brew "mysql-client"
brew "norwoodj/tap/helm-docs"
brew "krew"
brew "bazel"
brew "yamllint"
brew "minamijoyo/tfmigrate/tfmigrate"
brew "bat"
brew "git-delta"
brew "the_silver_searcher"
brew "gopls"
brew "golangci-lint"
brew "kubie"
brew "shellcheck"

# appps
cask "gpg-suite"
cask "google-chrome"
cask "slack"
cask "visual-studio-code"
cask "postman"
cask "sublime-text"
cask "iterm2"
cask "firefox"
cask "keybase"
cask "spotify"
cask "font-hack"
cask "sonos"
cask "bartender"
cask "moom"
cask "viscosity"
cask "lastpass"
cask "google-drive-file-stream"
cask "typora"
cask "popclip"
cask "robscott/tap/kube-capacity"
cask "raindropio"
cask "signal"

# mas
mas "Xcode", id: 497799835
mas "The Unarchiver", id: 425424353
mas "Keynote", id: 409183694
mas "iMovie", id: 408981434
mas "Bear", id: 1091189122
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "1Password", id: 1333542190
