# taps
tap "homebrew/binary"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/cask-drivers"
tap "caskroom/cask"
tap "sambadevi/powerlevel9k"
tap "shopify/shopify"
tap "robscott/tap"

# binaries
brew "argo"
brew "cookiecutter"
brew "gitlab-runner"
brew "stow"
brew "grep"
brew "kind"
brew "awscli"
brew "saml2aws"
brew "elixir"
brew "bash"
brew "direnv"
brew "jq"
brew "python"
brew "bash-completion@2"
brew "python3"
brew "bazaar"
brew "cfssl"
brew "rbenv"
brew "coreutils"
brew "curl"
brew "ruby"
brew "screen"
brew "socat"
brew "findutils"
brew "fzf"
brew "moreutils"
brew "gcc"
brew "ssh-copy-id"
brew "node"
brew "git"
brew "openssh"
brew "tmux"
brew "git-crypt"
brew "openssl"
brew "tree"
brew "glide"
brew "watch"
brew "wget"
brew "mas"
brew "gnu-sed"
brew "kubectx"
brew "hub"
brew "wireguard-tools"
brew "yq"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "asdf"
brew "vault"
brew "pipenv"
brew "lastpass-cli"
brew "nvim"
brew "ansible"
brew "pre-commit"
brew "mfuentesg/tap/ksd"
brew "stern"
brew "FairwindsOps/tap/rbac-lookup"
brew "minamijoyo/tfupdate/tfupdate"
brew "ack"
brew "ejson"
brew "zaquestion/tap/lab"
brew "norwoodj/tap/helm-docs"
brew "krew"
brew "bazel"
brew "yamllint"
brew "git-delta"
brew "the_silver_searcher"
brew "gopls"
brew "golangci-lint"
brew "kubie"
brew "shellcheck"
brew "httpstat"
brew "FairwindsOps/tap/pluto"
brew "cleanshot"
brew "dive"
brew "coreutils"
brew "obsidian"

# appps
cask "google-chrome"
cask "slack"
cask "visual-studio-code"
cask "postman"
cask "sublime-text"
cask "iterm2"
cask "firefox"
cask "font-hack"
cask "sonos"
cask "bartender"
cask "moom"
cask "viscosity"
cask "lastpass"
cask "google-drive-file-stream"
cask "typora"
cask "signal"
cask "contexts"
cask "gpg-suite"

# mas
mas "The Unarchiver", id: 425424353
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "1Password", id: 1333542190
mas "Meeter", id: 1510445899
mas "rcmd", id: 1596283165
mas "GoodLinks", id: 1474335294
mas "PopClip", id: 445189367
