# taps
tap "homebrew/binary"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/cask-drivers"


# binaries
brew "stow"
brew "autoconf"
brew "grep"
brew "pcre2"
brew "awscli"
brew "icu4c"
brew "pkg-config"
brew "bash"
brew "isl"
brew "jq"
brew "python"
brew "bash-completion@2"
brew "kubernetes-cli"
brew "python3"
brew "bazaar"
brew "kubernetes-helm"
brew "python@2"
brew "cfssl"
brew "libevent"
brew "rbenv"
brew "coreutils"
brew "libidn2"
brew "readline"
brew "curl"
brew "libmpc"
brew "ruby"
brew "docker"
brew "libtool"
brew "ruby-build"
brew "docker-compose"      
brew "libunistring"        
brew "screen"
brew "docker-machine"      
brew "libyaml"
brew "socat"
brew "findutils"
brew "moreutils"
brew "sqlite"
brew "gcc"
brew "mpfr"
brew "ssh-copy-id"
brew "gdbm"
brew "node"
brew "stern"
brew "gettext"
brew "terraform"
brew "git"
brew "openssh"
brew "tmux"
brew "git-crypt"
brew "openssl"
brew "tree"
brew "glide"
brew "openssl"
brew "watch"
brew "gmp"
brew "wget"
brew "go"
brew "pcre"
brew "xz"
brew "mas"
brew "gnu-sed"
brew "kubectx"
brew "kubeless"

# appps
cask "gpg-suite"
cask "google-chrome"
cask "slack"
cask "visual-studio-code"
cask "atom"
cask "postman"
cask "sublime-text"
cask "chefdk"
cask "iterm2"
cask "firefox"
cask "keybase"
cask "vagrant"
cask "spotify"
cask "virtualbox"
cask "font-hack"
cask "sonos"

# mas
mas "Xcode", id: 497799835
mas "The Unarchiver", id: 425424353
mas "Keynote", id: 409183694
mas "iMovie", id: 408981434
mas "Skitch", id: 425955336
mas "Bear", id: 1091189122
mas "Pages", id: 409201541
mas "Reeder", id: 880001334
mas "Numbers", id: 409203825
mas "1Password", id: 1333542190
mas "Magnet", id: 441258766
